results/memcache_1/tsung_test.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="35.160.253.56" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="1.5" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="60" unit="second">
     <users arrivalrate="4" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="60" unit="second">
     <users arrivalrate="6" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="60" unit="second">
     <users arrivalrate="10" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="7" duration="60" unit="second">
     <users arrivalrate="16" unit="second"/>
   </arrivalphase>
   </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="simple-user" probability="100" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="current_user_id"/>
      </setdynvars>

      <request subst="true">
        <http url="/login" version="1.1" method="POST" contents="session%5Bemail%5D=user_%%_current_user_id%%%40example.com&amp;session%5Bpassword%5D=password&amp;session%5Bremember_me%5D=0%%&amp;commit=Log+in"/>
      </request>

      <for from="1" to="10" incr="1" var="counter">
        <thinktime value="1" random="true"/>

        <request subst="true">
          <http url="/users/%%_current_user_id%%" version="1.1" method="GET"/>
        </request>

        <thinktime value="1" random="true"/>

        <request>
          <http url="/" version="1.1" method="GET"/>
        </request>
      </for>


    </session>
  </sessions>
</tsung>